title: Microsoft Word Template Injection Attack
id: 6c6bc276-498a-447d-9795-d61dbd057eb6
status: production
description: Detects word documents template injection attack used in phishing campaigns, while opening the word it will request a DOTM file contains the macro to bypass security controls
references:
author: Abdelnaser Khanafeer
date: 2023/05/10
tags:
    - attack.defense_evasion
    - attack.initial_access
    - attack.t1566.001
logsource:
    category: proxy
detection:
    selection:
        c-useragent|contains:
            - 'Microsoft Office Word'
            - 'ms-office'
            - 'MSOffice'
        cs-method:
            - 'GET'
            - 'HEAD'
            - 'OPTIONS'
    condition: selection
falsepositives:
    - Requests to microsoft related domains (low)
level: high