title: PDF Readers Downloads Suspicious Files
id: b9eb533e-a541-4e43-861a-cc2233cc4490
status: test
description: In a recent Phishing campaign in December 2022, Qbot used one of the longest series of stages to reach the malicious payload, starting from sending an email containing a PDF which upon user click opens a URL that directly downloads a password-protected zip file, which contains an ISO file that after mounting it, it shows to the user a WSF file that run a job containing VBScript and Jscript code which invokes another Jscript code.
references:
    - https://dphish.com/2023/01/07/qbot-from-pdf-to-wsf-execution-between-the-analysis-and-emulation/
author: Abdlenaser Khanafeer
date: 2023/03/05
tags:
    - attack.initial_access
    - attack.t1566.001
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        - ParentImage|endswith:
            - '\FoxitPDFReader.exe'
            - '\Acrord32.exe'
            - '\Acrobat.exe'
        - Image|endswith:
              - '\chrome.exe'
              - '\firefox.exe'
              - '\msedge.exe'
        - CommandLine:
            # List of Downloaded Extentions
            - 'http*.zip'
            - 'http*.exe'
            - 'http*.dll'
            - 'http*.jar'
            - 'http*.bat'
            - 'http*.wsf'
            - 'http*.lnk'
            - 'http*.rar'
            - 'http*.ps1'
    condition: selection
falsepositives:
    - Download legitimate files
level: high
